In [1]:
!pip install sqlalchemy
!pip install pymysql
!pip install mysql-connector

Requirement already satisfied: sqlalchemy in c:\users\surface\anaconda3\lib\site-packages (1.3.18)
Requirement already satisfied: pymysql in c:\users\surface\anaconda3\lib\site-packages (1.0.2)
Requirement already satisfied: mysql-connector in c:\users\surface\anaconda3\lib\site-packages (2.2.9)

# Import libraries

In [2]:
import pandas as pd
import sqlalchemy #databse connection module
import mysql.connector

import mysql.connector
import pandas as pd
import sqlalchemy

In [3]:
#connect databases
mydb=mysql.connector.connect(host="localhost",user="root",password ="1234",database="srv")

In [4]:
cur = mydb.cursor()

### Create a table named‘PRODUCT’with followingcolumns and constraints.
#### Code (PRIMARY KEY) - integer
#### Name - Strings
#### Price - integer
#### Manufacturer (Unique) - String

In [44]:
cur.execute("create table product(Code int(15) NOT NULL AUTO_INCREMENT PRIMARY KEY,Name varchar(40),Price int(100),Manufacturer varchar(100) UNIQUE)")
mydb.commit()

In [101]:
'''
f = open("input.txt", "r")
for _ in range(1,20):
    line=f.readline()
    arr=line.split(",")
    cur.execute("insert into product values(int(arr[0]),arr[1],int(arr[2]),arr[3])")
    mydb.commit()'''

'\nf = open("input.txt", "r")\nfor _ in range(1,20):\n    line=f.readline()\n    arr=line.split(",")\n    cur.execute("insert into product values(int(arr[0]),arr[1],int(arr[2]),arr[3])")\n    mydb.commit()'

# Insert 10 or more data in the “Product” table

In [45]:
cur.execute("insert into product values(1,'I phone case',500,'manufacture1')")
cur.execute("insert into product values(2,'BT headphone',200,'manufacture2')")
cur.execute("insert into product values(3,'keyboard',100,'manufacture3')")
cur.execute("insert into product values(4,'mouse',150,'manufacture4')")
cur.execute("insert into product values(5,'router',250,'manufacture5')")
cur.execute("insert into product values(6,'monitor',300,'manufacture6')")
cur.execute("insert into product values(7,'TV',800,'manufacture7')")
cur.execute("insert into product values(8,'ps4',1500,'manufacture8')")
cur.execute("insert into product values(9,'AC',3000,'manufacture9')")
cur.execute("insert into product values(10,'USB hub',50,'manufacture10')")
mydb.commit()

# connect with database 'srv'

In [46]:

engine = sqlalchemy.create_engine('mysql+pymysql://root:1234@localhost:3306/srv')

# converting the table into df formet

In [47]:

df = pd.read_sql_table('product',engine)

In [48]:
df

   Code          Name  Price   Manufacturer
0     1  I phone case    500   manufacture1
1     2  BT headphone    200   manufacture2
2     3      keyboard    100   manufacture3
3     4         mouse    150   manufacture4
4     5        router    250   manufacture5
5     6       monitor    300   manufacture6
6     7            TV    800   manufacture7
7     8           ps4   1500   manufacture8
8     9            AC   3000   manufacture9
9    10       USB hub     50  manufacture10

Select the names of all the products in the store

In [49]:

df = pd.read_sql_query("select name from product",engine)
df

           name
0  I phone case
1  BT headphone
2      keyboard
3         mouse
4        router
5       monitor
6            TV
7           ps4
8            AC
9       USB hub

Select the names and the prices of all the productsin the store.

In [50]:

df = pd.read_sql_query("select name,price from product",engine)
df

           name  price
0  I phone case    500
1  BT headphone    200
2      keyboard    100
3         mouse    150
4        router    250
5       monitor    300
6            TV    800
7           ps4   1500
8            AC   3000
9       USB hub     50

 Select the name of the products with a price less than or equal to $200.

In [51]:

df = pd.read_sql_query("select name from product where price < 200",engine)
df

       name
0  keyboard
1     mouse
2   USB hub

Select all the products with a price between $60 and $120.

In [52]:

df = pd.read_sql_query("select name from product where price between 60 and 120",engine)
df

       name
0  keyboard

Select the name and price in cents (i.e., the price must be multiplied by 100).

In [53]:
df = pd.read_sql_query("select name, price*100 from product",engine)
df

           name  price*100
0  I phone case      50000
1  BT headphone      20000
2      keyboard      10000
3         mouse      15000
4        router      25000
5       monitor      30000
6            TV      80000
7           ps4     150000
8            AC     300000
9       USB hub       5000

Compute the average price of all the products.

In [54]:

df = pd.read_sql_query("select price from product",engine)
mean=df.mean()
mean

price    685.0
dtype: float64

Compute the average price of all products with manufacturer code equal to 2

In [77]:
query ='''
select * from product where name like 's%'
'''
df = pd.read_sql_query("select * from product where Manufacturer like '%%2'",engine)
df

   Code          Name  Price  Manufacturer
0     2  BT headphone    200  manufacture2

 Compute the number of products with a price larger than or equal to 180.

In [78]:
df= pd.read_sql_query("select count(*) from product where price<= 180",engine)
df

   count(*)
0         3

Select the name and price of all products with a price larger than or equal to $180,
and sort first by price (in descending order)

In [79]:
df= pd.read_sql_query("select name, price from product where price<= 180 order by price desc",engine)
df

       name  price
0     mouse    150
1  keyboard    100
2   USB hub     50

Select the average price of each manufacturer's products, showing the manufacturer's name.

In [80]:
df = pd.read_sql_query("select avg(price) , Manufacturer from product group by Manufacturer", engine)
df

   avg(price)   Manufacturer
0       500.0   manufacture1
1        50.0  manufacture10
2       200.0   manufacture2
3       100.0   manufacture3
4       150.0   manufacture4
5       250.0   manufacture5
6       300.0   manufacture6
7       800.0   manufacture7
8      1500.0   manufacture8
9      3000.0   manufacture9

Select the names of manufacturers whose products have an average price larger
than or equal to 150.

In [81]:
df = pd.read_sql_query(" select Manufacturer from product group by Manufacturer having avg(price) >= 150",engine)
df

   Manufacturer
0  manufacture1
1  manufacture2
2  manufacture4
3  manufacture5
4  manufacture6
5  manufacture7
6  manufacture8
7  manufacture9

 Select the name and price of the cheapest product.

In [82]:
df = pd.read_sql_query("select name from product order by price asc limit 1",engine)
df

      name
0  USB hub

Add a new product: Loudspeakers, $70, manufacturer 2.

In [86]:
cur.execute("insert into Product values (11, 'Loudspeakers', 70, 2);")
mydb.commit()

In [88]:
df = pd.read_sql_table('product',engine)
df

    Code          Name  Price   Manufacturer
0      1  I phone case    500   manufacture1
1      2  BT headphone    200   manufacture2
2      3      keyboard    100   manufacture3
3      4         mouse    150   manufacture4
4      5        router    250   manufacture5
5      6       monitor    300   manufacture6
6      7            TV    800   manufacture7
7      8           ps4   1500   manufacture8
8      9            AC   3000   manufacture9
9     10       USB hub     50  manufacture10
10    11  Loudspeakers     70              2

 Update the name of product 8 to "Laser Printer".

In [97]:

cur.execute("update product set Name ='Laser Printer' where Code= 8 ")
mydb.commit()

In [98]:
df = pd.read_sql_table('product',engine)
df

    Code           Name  Price   Manufacturer
0      1   I phone case    500   manufacture1
1      2   BT headphone    200   manufacture2
2      3       keyboard    100   manufacture3
3      4          mouse    150   manufacture4
4      5         router    250   manufacture5
5      6        monitor    300   manufacture6
6      7             TV    800   manufacture7
7      8  Laser Printer   1500   manufacture8
8      9             AC   3000   manufacture9
9     10        USB hub     50  manufacture10
10    11   Loudspeakers     70              2

 DELETE the last 4 rows where price is greater than $300.

In [99]:
cur.execute("delete from product where price >300 ")
mydb.commit()

In [100]:
df = pd.read_sql_table('product',engine)
df

   Code          Name  Price   Manufacturer
0     2  BT headphone    200   manufacture2
1     3      keyboard    100   manufacture3
2     4         mouse    150   manufacture4
3     5        router    250   manufacture5
4     6       monitor    300   manufacture6
5    10       USB hub     50  manufacture10
6    11  Loudspeakers     70              2